package com.example.zhuwojia.searchlistdemo.constant;

/**
 * author：shixinxin on 2016/12/22
 * version：v1.0
 */

public class Cities {
    public static final String[] mCitiesStrings = {
            "A", "阿坝", "阿克苏", "阿拉尔", "阿拉善", "阿勒泰", "阿里", "安康", "安庆", "鞍山", "安顺", "安阳", "澳门",
            "B", "白沙", "白山", "白洋淀", "保定", "宝鸡", "保亭", "包头", "巴中", "北戴河", "北海", "北京", "白银", "蚌埠", "本溪", "滨州", "博鳌", "博尔塔拉", "亳州",
            "C", "沧州", "长白山", "长春", "常德", "昌吉", "昌江", "长沙", "长治", "常州", "潮州", "承德", "成都", "澄迈", "郴州", "赤峰", "池州", "崇礼", "重庆", "崇左", "楚雄", "滁州", "从化",
            "D", "大理", "大连", "丹东", "儋州", "大庆", "大同", "德宏", "登封", "德阳", "德州", "定西", "东方", "东莞", "东营", "都江堰", "敦煌",
            "E", "鄂尔多斯", "峨眉山", "恩施", "鄂州",
            "F", "防城港", "凤凰", "佛山", "抚顺", "阜阳", "福州", "抚州",
            "G", "甘南", "赣州", "甘孜", "高雄", "广元", "广州", "桂林", "贵阳", "鼓浪屿", "固原",
            "H", "哈尔滨", "海北", "海东", "海口", "海螺沟", "海南州", "海西", "哈密", "邯郸", "杭州", "汉中", "河池", "合肥", "黑河", "横店", "衡水", "衡阳", "河源",
                "菏泽", "贺州", "红河州", "花都", "淮安", "淮北", "花莲", "黄冈", "黄南", "黄山", "黄石", "呼和浩特", "惠州", "葫芦岛", "呼伦贝尔", "湖州",
            "J", "吉安", "江门", "焦作", "嘉兴", "嘉义", "嘉峪关", "揭阳", "吉林", "济南", "晋城", "景德镇", "井冈山", "荆门", "金华", "济宁", "金门", "晋中", "锦州",
                "九华山", "九江", "酒泉", "九寨沟", "鸡西", "济源",
            "K", "开封","克拉玛依","昆明","昆山",
            "L", "莱芜","廊坊","阆中","兰州", "拉萨","乐东",    "乐山", "凉山", "连云港", "聊城", "丽江",
                "临汾","临高", "陵水","临夏", "临沂", "林芝", "丽水", "六安", "六盘水", "柳州","龙岩","娄底", "洛阳","庐山","泸州", "吕梁",
            "M", "马鞍山", "满洲里", "眉山", "梅州", "绵阳","苗栗", "牡丹江",
            "N", "南昌","南充", "南京", "南宁","南通","南投","南阳", "内江", "宁波","宁德",
            "P", "盘锦", "攀枝花","澎湖","蓬莱", "平顶山", "平凉", "萍乡", "莆田", "濮阳","普洱",
            "Q", "青岛", "黔东南", "黔南", "黔西南", "庆阳", "清远", "秦皇岛", "钦州", "齐齐哈尔", "泉州", "曲靖", "衢州",
            "R", "日喀则", "日照",
            "S", "上海", "深圳", "苏州", "沈阳", "石家庄", "三门峡", "三明", "三亚", "商洛", "商丘", "上饶", "山南", "汕头", "汕尾", "韶关", "绍兴", "邵阳", "十堰", "朔州", "四平", "绥化", "遂宁", "随州", "宿迁", "宿州",
            "T", "天津", "太原", "泰安", "泰州", "台州", "唐山", "天水", "铁岭", "铜川", "通化", "通辽", "铜陵", "铜仁", "台湾",
            "W", "武汉", "乌鲁木齐", "无锡", "威海", "潍坊", "文山", "温州", "乌海", "芜湖","乌兰察布", "武威", "梧州",
            "X", "厦门", "西安", "西宁", "襄樊", "湘潭", "湘西", "咸宁", "咸阳", "孝感", "邢台", "新乡", "信阳", "新余", "忻州", "西双版纳", "宣城", "许昌", "徐州", "香港", "锡林郭勒", "兴安",
            "Y", "银川", "雅安", "延安", "延边", "盐城", "阳江", "阳泉", "扬州", "烟台", "宜宾", "宜昌", "宜春", "营口", "益阳", "永州", "岳阳", "榆林", "运城", "云浮", "玉树", "玉溪", "玉林",
            "Z", "枣庄","张家港","张家界","张家口","章丘","张掖","漳州","湛江","肇庆","昭通","郑州","镇江","重庆","中山","中卫",
            "中卫","周口","舟山","珠海","诸暨","驻马店","涿州","株洲","淄博","自贡","资阳","遵义"
    };
}
